<?php

  // function sum($a = 1, $b = 2) {  // $a и $b являются тут локальными переменными

  //         $a = 300;

  //         echo $a + $b;
  //         echo '<br>';
  // }

  // ==============================================================
      // Елси $a оставим как есть, то выведется 5
      // Если передадим переменную $a по ссылке, то она изменится на 100
//   function sum(&$a, $b) {  

//     echo $a + $b;
//     echo '<br>';
//     $a = 100;
// }

// ==============================================================
      // Елси $a оставим как есть, то выведется 5
      // Если передадим переменную $a по ссылке, то она изменится на 100
      
    //   function sum(&$a, $b) {  
    //     echo $a + $b;
    //     echo '<br>';
    //     $a = 100;
    // }

// ==============================================================
      // return

    // function sum($a, $b) {
    //   $c = $a + $b;
    //   return $c;
    // }

// ==============================================================

function my_array_keys($arr) {
  $data = [];
  foreach($arr as $k => $v) {
    $data[] = $k;
  }
  return $data;
}